nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac.c
/******************************************************************************

 @file  mac.c

 @brief This file contains the data structures and APIs for CC13xx
        RF Core Firmware Specification for IEEE 802.15.4.

 Group: WCS, LPC
 Target Device: cc13xx_cc26xx

 ******************************************************************************
 
 Copyright (c) 2009-2021, Texas Instruments Incorporated
 All rights reserved.

 IMPORTANT: Your use of this Software is limited to those specific rights
 granted under the terms of a software license agreement between the user
 who downloaded the software, his/her employer (which must be your employer)
 and Texas Instruments Incorporated (the "License"). You may not use this
 Software unless you agree to abide by the terms of the License. The License
 limits your use, and you acknowledge, that the Software may not be modified,
 copied or distributed unless embedded on a Texas Instruments microcontroller
 or used solely and exclusively in conjunction with a Texas Instruments radio
 frequency transceiver, which is integrated into your product. Other than for
 the foregoing purpose, you may not use, reproduce, copy, prepare derivative
 works of, modify, distribute, perform, display or sell this Software and/or
 its documentation for any purpose.

 YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
 PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
 INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
 NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
 TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
 NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
 LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
 INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
 OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
 OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
 (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

 Should you have any questions regarding your right to use this Software,
 contact Texas Instruments Incorporated at www.TI.com.

 ******************************************************************************
 
 
 *****************************************************************************/

/*******************************************************************************
 * INCLUDES
 */

#ifndef LIBRARY
#include "ti_wisunfan_features.h"
#endif

#include <stdint.h>
#include <rf_mailbox.h>
#include "rf_mac_api.h"
#include "crypto_mac_api.h"
#include "mac_user_config.h"

#include "hw_memmap.h"
#include "hw_aon_rtc.h"
#include "hal_types.h"
#include "hal_defs.h"

#include "saddr.h"

#include "mac_high_level.h"
#include "mac.h"
#include "mac_activity.h"
#include "mac_spec.h"
#include "mac_mem.h"
#include "mac_pib.h"
#include "mac_rx.h"
#include "mac_tx.h"
#include "mac_rx_onoff.h"
#include "mac_settings.h"
#include "mac_radio.h"
#include "mac_radio_defs.h"
#include "mac_symbol_timer.h"

/* High Level MAC */
#include "mac_timer.h"
#include "mac_beacon.h"
#include "mac_main.h"
#include "mac_data.h"
#include "mac_mgmt.h"
#include "macs.h"
#include "mac_low_level.h"
#include "mac_hl_patch.h"

/* Driverlib */
#include <hw_prcm.h>
#include <hw_rfc_pwr.h>

/* Activity Tracking */
#include "mac_activity.h"

/* debug */
#include "mac_assert.h"

// SW Tracer
#include "dbg.h"
#ifdef DEBUG_SW_TRACE
#define DBG_ENABLE
#ifndef _DBGFILE
#define _DBGFILE mac_c
#endif
#include "dbgid_sys_mst.h"
#endif // DEBUG_SW_TRACE

#include "rom_jt_154.h"
/*******************************************************************************
 * MACROS
 */

/*******************************************************************************
 * CONSTANTS
 */

#define MAX_REQACCESS_CNT         1

/*******************************************************************************
 * GLOBAL VARIABLES
 */
uint32_t* lastPostCmd = NULL; /* Track the last RF post cmd */

/*******************************************************************************
 * LOCAL VARIABLES
 */
macSfdDetectCBack_t macSfdDetectCback = NULL;

/* WA to re-initialize RAT compare on the channel in use */
volatile int8_t lastRatChanA = RF_ALLOC_ERROR;
volatile int8_t lastRatChanB = RF_ALLOC_ERROR;

#if defined(RCN_APP_ASSERT)
static APPASRTINTF_assrtHndlerFunc_t assertFP = {NULL};
#endif

/*******************************************************************************
 * GLOBAL VARIABLES
 */
/* Radio command active */
volatile uint8_t macRxCmdActive = FALSE;
volatile uint8_t macTxCmdActive = FALSE;
volatile uint8_t macFsCmdActive = FALSE;

/* MAC TX timestamp */
uint32_t macTxTimestamp;

/* Reveive output buffer */
#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
rfc_propRxOutput_t macRxOutputSubG;
#endif

/* MAC RF front end configuration. Use a pointer to void since
 * the format changes from package to package.
 */
macUserCfg_t *pMacRadioConfig;

/* MAC frame filter */
macFrmFilter_t macFrmFilter;

/* RX command handle */
RF_CmdHandle rxCmdHandle;

#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
uint16 macReqAccessCnt = 0;
uint8 macReqAccessTimeCnt = 0;
uint8 reqAccessAlloc = 0;
uint16 macReqAccErrCnt = 0;
#endif

/* Number of pending RF command */
volatile int8_t numRfCmd = 0;

/* Number of pending RX command */
volatile int8_t numRxCmd = 0;

volatile int8_t numRxPostCmd = 0;

#if defined(RFCORE49)
/* Debug count for timedout RX commands */
static uint8 mac_rx_timeoutCnt=0;
#endif

/* RF driver function table */
uint32_t *macRfDrvTblPtr;

/* Tx/Rx backoff Timer Id's */
static MAP_ICall_TimerID macTxBackoffRtcTimerId, macRxBackoffRtcTimerId;

#ifdef DBG_TIMAC_RADIO_CB
uint8_t macRadDbg_idx = 0;
macRadioDbg_t macRadioDbg[MAX_RADIO_DBG_CNT] = {0};
#endif

/*******************************************************************************
 * LOCAL FUNCTIONS
 */
#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
static void macSetCurrChan( void );
#endif

