nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac.c
/*******************************************************************************
 * @fn          macSetupFsCmd
 *
 * @brief       This function sets up the FS Cmd.
 *
 * input parameters
 *
 * @param       channel - logical channel for this frequency band.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void macSetupFsCmd( uint8 channel )
{
  uint32 frequency;
  macMRFSKPHYDesc_t *pPhyDesc;
#ifdef FH_HOP_DEBUG_FIXED
  channel = 11;
#endif
  pPhyDesc = MAP_macMRFSKGetPhyDesc(pMacPib->curPhyID);
  frequency = pPhyDesc->firstChCentrFreq + pPhyDesc->channelSpacing * channel;

  /* Prepare for the FS command per channel */
  RF_cmdFsRx.frequency = (uint16)(frequency / 1000);
  RF_cmdFsRx.fractFreq =
    (uint16)((frequency - 1000 * RF_cmdFsRx.frequency) * 8192 / 125);
  RF_cmdFsTx.frequency = RF_cmdFsRx.frequency;
  RF_cmdFsTx.fractFreq = RF_cmdFsRx.fractFreq;
}


/*******************************************************************************
 * @fn          macSetupReceiveCmd
 *
 * @brief       This routine is used to setup MAC receive command.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void macSetupReceiveCmd( void )
{
  uint8  mrFSKSFD;

  /* Get the sync word format from PIB */
  MAP_MAC_MlmeGetReq(MAC_PHY_MRFSKSFD, &mrFSKSFD);

  /* Set receive queue and output buffer */
  RF_cmdPropRxAdv.pQueue = (dataQueue_t*)&macRxDataEntryQueue;
  RF_cmdPropRxAdv.pOutput = (uint8_t *)&macRxOutputSubG;

  /* For uncoded SFD value on RX and ACK TX */
  RF_cmdPropRxAdv.syncWord0 = RF_cmdPropTxAdv.syncWord =
    (mrFSKSFD == 0)? MAC_2FSK_UNCODED_SFD_0 : MAC_2FSK_UNCODED_SFD_1;
}

#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
static void macSetCurrChan( void )
{
  /* Previous FS and RX have failed. Issue a new one. */
  if (MAC_FH_ENABLED)
  {
    MAC_RADIO_SET_CHANNEL(macPhyChannel);
  }
}
#endif

#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
/**************************************************************************************************
 * @fn          macRxCbSubG
 *
 * @brief       This callback is called when a RX radio command is executed.
 *
 * @param       h  - RF handle
 *              ch - RF command handle
 *              e  - RF event mask
 *
 * @return      none
 **************************************************************************************************
 */
static void macRxCbSubG(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
  static RF_CmdHandle ch_prev = RF_ALLOC_ERROR;
  static RF_EventMask e_prev = 0;
  static uint16 s_prev = IDLE;

  /* Now we are in swi context */
  bInSwi = TRUE;

  DBG_PRINT1(DBGSYS, "RX: macRxCb(ch=%i)", ch);
  DBG_PRINTL2(DBGSYS, "RX: macRxCb(event=0x%08X%08X)", (e >> 32), e & 0xFFFFFFFF);
  DBG_PRINT1(DBGSYS, "RX: macRxCb(status=0x%X)", RF_cmdPropRxAdv.status);
  /* FS command should have been completed or cancelled */
  macFsCmdActive = FALSE;
#ifdef DBG_TIMAC_RADIO_CB
  macRadioDbg[macRadDbg_idx].fn = MAC_RX_CB_FN,
  macRadioDbg[macRadDbg_idx].rf_cmd_hnd = rxCmdHandle;
  macRadioDbg[macRadDbg_idx].rf_hnd = h;
  macRadioDbg[macRadDbg_idx].ch_var = ch;
  macRadioDbg[macRadDbg_idx].rf_event = e;
  macRadioDbg[macRadDbg_idx].sfd_detect = e & RF_EventMdmSoft;
  macRadioDbg[macRadDbg_idx].clk_ticks = Clock_getTicks();
  macRadioDbg[macRadDbg_idx].rf_cmd_status = RF_cmdPropRxAdv.status;
  macRadioDbg[macRadDbg_idx].numRxCmd = numRxCmd;
  macRadioDbg[macRadDbg_idx].numRfCmd = numRfCmd;
  macRadDbg_idx = macRadDbg_idx + 1;
  macRadDbg_idx = macRadDbg_idx % MAX_RADIO_DBG_CNT;
#endif

  if (e & RF_EventMdmSoft)
  {
    /* Invalidate saved command handle */
    ch_prev = RF_ALLOC_ERROR;

    if (MAC_FH_ENABLED)
    {
      DBG_PRINT3(DBGSYS, "RX: SFD Detected, macRxActive=%d, macTxACtive=%d, macRxAckFlag=%d",macRxActive, macTxActive, macRxOutgoingAckFlag);

      if((macTxActive != MAC_TX_ACTIVE_GO))
      {
        /* To prevent If no EventRxOK or NOK Cbs, will get stuck at MAC_RX_ACTIVE_STARTED */
        macRxActive = MAC_RX_ACTIVE_STARTED;
      }
      if (macSfdDetectCback != NULL)
      {
        /* Jump to FH module */
        (macSfdDetectCback)(MAC_SFD_DETECTED);
        ch_prev = ch;

      }
    }
  }
  else if (e & (RF_EventCmdCancelled | RF_EventCmdStopped | RF_EventCmdAborted))
  {
      if(numRxCmd > 0)
      {
          numRxCmd--;
      }

    /* Update activity tracking information if necessary */
    if ((activityObject.pSetActivityTrackingRxFn) && (e & RF_EventCmdPreempted))
    {
        activityObject.pSetActivityTrackingRxFn(NULL, false);
    }

    if (e & RF_EventCmdPreempted)
    {
        /* Start the next RX command only if allowed. */
        macRxOnRequest();
    }

    /* If Radio issues RxAborted Event, then MAC issues RF_Cancel cmd. RF Driver does not
     * give a RF_LastCmdDone Event. Hence, we need to issue rxOnRequest here
     */

    if(e_prev & RF_EventRxAborted)
    {
        macRxOnRequest();
        e_prev = e;
    }

    /* Invalidate saved command handle */
    if (ch_prev == ch)
    {
#ifdef FH_HOP_DEBUG
      macSfdDbg.num_sfd_rx_stop++;
#endif
      if ((e_prev == RF_EventRxOk && s_prev == PROP_DONE_OK) ||
          (e_prev == RF_EventRxAborted && s_prev == ACTIVE))
      {
        /* This is not an abort originally intended.
         * Treat this as RF_EventRxNok.
         */
        DBG_PRINT0(DBGSYS, "RX: Treat unexpected RF_EventRxOk/RF_EventLastCmdDone as RF_EventRxNOk");
        macRxNokIsr();

        /* Start the next RX command only if allowed. */
        macRxOnRequest();
      }
      else
      {
        macRxHaltCleanup();
      }
    }

    ch_prev = RF_ALLOC_ERROR;

    if(numRfCmd > 0)
    {
        numRfCmd--;
    }
  }
  else if (e & (RF_EventRxOk | RF_EventRxBufFull | RF_EventRxNOk))
  {
    /* Save this command handle, event and status */
    ch_prev = ch;
    e_prev = e;
    s_prev = RF_cmdPropRxAdv.status;

    /* The last RX might have been done successfully, but we reject this
     * so that it will be handled as an error when CmdStopped or CmdAborted comes.
     * This happens very rare, so is barely going to impact the performance.
     */
    if ((e == RF_EventRxOk) && (RF_cmdPropRxAdv.status == PROP_DONE_OK))
    {
      DBG_PRINT0(DBGSYS, "RX: RF_EventRxOk without RF_EventLastCmdDone");
      RF_cancelCmd(RF_handle, ch, FALSE);
    }
  }
  else if (e & (RF_EventRxIgnored | RF_EventRxEmpty |RF_EventRxAborted |
                RF_EventRxCollisionDetected | RF_EventInternalError))
  {
    /* Save this command handle and event */
    ch_prev = ch;
    e_prev = e;
    s_prev = RF_cmdPropRxAdv.status;

    if ((e == RF_EventRxAborted) && (RF_cmdPropRxAdv.status == ACTIVE || RF_cmdPropRxAdv.status == IDLE))
    {
      /* In FH case, we have to forcefully abort the on-going RX if it was once aborted
       * for some reason and restarted.
       */
      DBG_PRINT0(DBGSYS, "RX: RF_EventRxAborted without Abort request");
      RF_cancelCmd(RF_handle, ch, FALSE);
    }
  }

