nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac.c
  /* RF_EventLastCmdDone can come alone or with another event */
  if (e & RF_EventLastCmdDone)
  {
#ifdef RFCORE49
    if((RF_cmdPropRxAdv.status == PROP_DONE_RXTIMEOUT) ||
       (RF_cmdPropRxAdv.status == PROP_DONE_STOPPED) ||
       (RF_cmdFsRx.status == ERROR_SYNTH_PROG))
    {
      mac_rx_timeoutCnt++;
      if(numRxCmd > 0)
      {
          numRxCmd--;
      }
      macRxHaltCleanup();
      macSetCurrChan();
    }
    else
#endif
    {
      /* The status has changed. There might be a pending RX command in the same location.
       * Reset the status to IDLE before CM0 process a possible pending RX command.
       */
      if(numRxCmd > 0)
      {
          numRxCmd--;
      }

      /* If a desired event is followed by RF_EventLastCmdDone, process it */
      if (ch_prev == ch)
      {
        if (e_prev & (RF_EventRxOk | RF_EventRxBufFull))
        {
          /* Packet received okay or RX buffer full. In case of RX buffer full,
           * the macRxFrameIsr() will attempt to allocate another OSAL buffer
           * for the last RX frame which was stuck in the macRxDataEntryQueue.
           */
#ifdef FH_HOP_DEBUG_FIXED
    fhDbg.rxCh = macPhyChannel;
#endif
          macRxFrameIsr();
        }
        else if (e_prev & RF_EventRxNOk)
        {
          /* CRC error - radio will auto flush */
          macRxNokIsr();
        }
        else
        {
#ifdef FH_HOP_DEBUG
          macSfdDbg.num_sfd_rx_abort++;
#endif
          macRxHaltCleanup();
        }
      }
      else /* shouldn't be here */
      {
        if (RF_cmdPropRxAdv.status == PROP_DONE_SYNTH_ERROR)
        {
          /* Previous FS and RX have failed. Issue a new one. */
    	  macSetCurrChan();
        }
        else /* shouldn't be here */
        {
          /**
           *  !!! removing the MAC_ASSERT(0) call, as there are
           *  conditions when the RF driver sends the
           *  RF_EventLastCmdDone without a corresponding error event.
          */
          DBG_PRINT1(DBGSYS, "RX before assert: macRxCb(ch=%i)", ch);
          DBG_PRINT1(DBGSYS, "RX before assert: macRxCb(chPrev=%i)", ch_prev);
          DBG_PRINTL2(DBGSYS, "RX before assert: macRxCb(event=0x%08X%08X)", (e >> 32), e & 0xFFFFFFFF);
        }
      }
    }

    RF_cmdPropRxAdv.status = IDLE;
    /* Invalidate saved command handle */
    ch_prev = RF_ALLOC_ERROR;

    /* Start the next RX command only if allowed. */
    if (MAC_FH_ENABLED)
    {
      if (!macRxOutgoingAckFlag)
      {
        macRxOnRequest();
      }
    }

    if(numRfCmd > 0)
    {
        numRfCmd--;
    }
  }

  if (numRxCmd == 0)
  {
    /* RX command is not active */
    macRxCmdActive = FALSE;
  }

  if (numRfCmd == 0)
  {
    /* If there is no pending RF command, try to power down */
    MAP_macPwrVote(FALSE, FALSE);
  }
  else if (e & (RF_EventCmdCancelled | RF_EventCmdStopped | RF_EventCmdAborted | RF_EventLastCmdDone))
  {
    MAC_ASSERT(numRfCmd > 0);
    DBG_PRINT1(DBGSYS, "RX: %i RF commands are pending. Can't power down.", numRfCmd);
  }

  /* Now we are exiting the swi */
  bInSwi = FALSE;
}
#endif

/**************************************************************************************************
 * @fn          macRxCb
 *
 * @brief       This callback is called when a RX radio command is executed.
 *
 * @param       h  - RF handle
 *              ch - RF command handle
 *              e  - RF event mask
 *
 * @return      none
 **************************************************************************************************
 */
void macRxCb(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    SELECT_CALL(macRxCb, h, ch, e);
}

#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
/*******************************************************************************
 * @fn          macSendReceiveCmdSubG
 *
 * @brief       This routine is used to send MAC receive command.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      TRUE if successful, FALSE otherwise
 */
bool macSendReceiveCmdSubG( void )
{
#ifndef FEATURE_WISUN_EDFE_SUPPORT
  if ( (lastPostCmd != (uint32_t*)&RF_cmdPropRxAdv)  || (numRxCmd == 0) )
#else
  if ( ((macTxActive != MAC_TX_ACTIVE_LISTEN_FOR_EDFE) && (macTxActive != MAC_TX_ACTIVE_LISTEN_FOR_ACK))
    &&  ((lastPostCmd != (uint32_t*)&RF_cmdPropRxAdv) || (numRxCmd == 0)) )
#endif
  {
    halIntState_t  s;
    RF_EventMask evtMask = RF_EventRxOk | RF_EventRxNOk | RF_EventRxBufFull;
    RF_Op   *rfOpPtr;

    HAL_ENTER_CRITICAL_SECTION(s);

    /* Post the RX cmd */
    RF_cmdPropRxAdv.status = IDLE;

    if (MAC_FH_ENABLED)
    {
      evtMask |= RF_EventMdmSoft | RF_EventRxIgnored | RF_EventRxEmpty | RF_EventRxAborted |
                 RF_EventRxCollisionDetected | RF_EventInternalError | RF_EventCmdPreempted;
    }
    RF_ScheduleCmdParams RF_schRxparams;
    RF_ScheduleCmdParams_init(&RF_schRxparams);

    RF_schRxparams.endTime = 0;
    /* No end time specified, MAC will abort running Rx when necessary */
    RF_schRxparams.endType = RF_EndInfinit;

    /* Calculate command duration, 125 = MAC_MAX_FRAME_SIZE for IEEE mode used as basis
     * for all Rx command durations for simplicity
     */
    if (macRxEnableFlags & MAC_RX_WHEN_IDLE)
    {
        RF_schRxparams.duration = 0;
    }
    else
    {
        RF_schRxparams.duration = macGetRFCmdDuration(125, false);
        RF_schRxparams.endType = RF_EndNotSpecified;
    }

    DBG_PRINT2(DBGSYS, "Rx Command Duration (%x), Frame Type: (%x)", RF_schRxparams.duration, NULL);

    /* Set activity for receive */
    if (activityObject.pSetActivityRxFn)
    {
        activityObject.pSetActivityRxFn(macRxEnableFlags);
    }

    /* Acquire Activity priority */
    if (activityObject.pGetActivityPriorityRxFn)
    {
        RF_schRxparams.activityInfo = activityObject.pGetActivityPriorityRxFn();
    }

#ifdef MAC_ACTIVITY_PROFILING
   sAddr_t dummy = {0};
   if ((activityObject.pPrintActivityInfoFn) && (activityObject.pGetActivityRxFn))
   {
       activityObject.pPrintActivityInfoFn(activityObject.pGetActivityRxFn(), RF_schRxparams.activityInfo, NULL, dummy);
   }
#endif

    /* For non rx-Ack, reset absolute time settings */
    RF_cmdPropRxAdv.startTime = 0x00;
    RF_cmdPropRxAdv.startTrigger.triggerType = TRIG_NOW;
    RF_cmdPropRxAdv.endTime = 1680000000;   //7 minutes

