nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac.c
    rfOpPtr = (RF_Op *)&RF_cmdPropRxAdv;

    /*
     * Check last posted command and FS command frequency against MAC frequency.
     * Last post command after a FS update will always be RF_cmdFsRx.
     */
    if ((lastPostCmd == (uint32_t*)&RF_cmdFsRx) ||
        (RF_handle->state.mode_state.cmdFs.fractFreq != RF_cmdFsRx.fractFreq) ||
        (RF_handle->state.mode_state.cmdFs.frequency !=  RF_cmdFsRx.frequency)) {

        macFsCmdActive = TRUE;

        /* Chain FS Command */
        RF_cmdFsRx.status = IDLE;
        RF_cmdFsRx.pNextOp = rfOpPtr;
        RF_cmdFsRx.condition.rule = COND_STOP_ON_FALSE;
        RF_cmdFsRx.startTime = 0x00;
        RF_cmdFsRx.startTrigger.triggerType = TRIG_NOW;

        rfOpPtr = (RF_Op *)&RF_cmdFsRx;
    }


    /* Switch to absolute time for FH and Beacon Rx */
    if (((MAC_FH_ENABLED) || (macRxEnableFlags & MAC_RX_BEACON_DEVICE)) && !(MAC_TX_IS_PHYSICALLY_ACTIVE()))
    {
        /* Update command chain to abs time */
        rfOpPtr->startTime = RF_getCurrentTime();
        rfOpPtr->startTrigger.triggerType = TRIG_ABSTIME;

        RF_schRxparams.startTime = rfOpPtr->startTime;
        RF_schRxparams.startType = RF_StartAbs;
    }

    rxCmdHandle = RF_scheduleCmd(RF_handle, (RF_Op*) rfOpPtr, &RF_schRxparams, macRxCb, evtMask);

    DBG_PRINT1(DBGSYS, "RX: RF_scheduleCmd(rxCmdHandle=%d)", rxCmdHandle);

    if (rxCmdHandle < 0)
    {
      HAL_EXIT_CRITICAL_SECTION(s);
      DBG_PRINT0(DBGSYS, "Rx: Command Rejected!");

      /* Update activity tracking information if necessary */
      if (activityObject.pSetActivityTrackingRxFn)
      {
          activityObject.pSetActivityTrackingRxFn(NULL, false);
      }

      /* Start backoff for Rx */
      macRequestBackoff(BACKOFF_TYPE_RX, MAC_REJECTED_PKT_BACKOFF);

      return FALSE;
    }

    numRxCmd++;
    numRfCmd++;
    lastPostCmd = (uint32_t*)&RF_cmdPropRxAdv;

    /* Cancel future backoff if successfully scheduled */
    macRequestBackoff(BACKOFF_TYPE_RX, 0);

    /* Configure PanCoordinator */
    MAC_RADIO_SET_PAN_COORDINATOR(macPanCoordinator);

    /* Set local addresses and PANID are send by macSendReceiveCmd() */
    MAC_RADIO_SET_PAN_ID(pMacPib->panId);
    MAC_RADIO_SET_SHORT_ADDR(pMacPib->shortAddress);
    MAC_RADIO_SET_EXT_ADDR(pMacPib->extendedAddress.addr.extAddr);

#ifdef DBG_TIMAC_RADIO_CB
  macRadioDbg[macRadDbg_idx].fn = MAC_RX_ISSUE,
  macRadioDbg[macRadDbg_idx].rf_cmd_hnd = rxCmdHandle;
  macRadioDbg[macRadDbg_idx].rf_hnd = RF_handle;
  macRadioDbg[macRadDbg_idx].ch_var = 0;
  macRadioDbg[macRadDbg_idx].rf_event = 0;
  macRadioDbg[macRadDbg_idx].sfd_detect = 0;
  macRadioDbg[macRadDbg_idx].clk_ticks = Clock_getTicks();
  macRadioDbg[macRadDbg_idx].rf_cmd_status = 0;
  macRadioDbg[macRadDbg_idx].numRxCmd = numRxCmd;
  macRadioDbg[macRadDbg_idx].numRfCmd = numRfCmd;
  macRadDbg_idx = macRadDbg_idx + 1;
  macRadDbg_idx = macRadDbg_idx % MAX_RADIO_DBG_CNT;
#endif

    HAL_EXIT_CRITICAL_SECTION(s);

    return TRUE;
  }

#ifdef DBG_TIMAC_RADIO_CB
  macRadioDbg[macRadDbg_idx].fn = MAC_RX_ISSUE,
  macRadioDbg[macRadDbg_idx].rf_cmd_hnd = rxCmdHandle;
  macRadioDbg[macRadDbg_idx].rf_hnd = RF_handle;
  macRadioDbg[macRadDbg_idx].ch_var = 0;
  macRadioDbg[macRadDbg_idx].rf_event = 0;
  macRadioDbg[macRadDbg_idx].sfd_detect = 1;
  macRadioDbg[macRadDbg_idx].clk_ticks = Clock_getTicks();
  macRadioDbg[macRadDbg_idx].rf_cmd_status = 0;
  macRadioDbg[macRadDbg_idx].numRxCmd = numRxCmd;
  macRadioDbg[macRadDbg_idx].numRfCmd = numRfCmd;
  macRadDbg_idx = macRadDbg_idx + 1;
  macRadDbg_idx = macRadDbg_idx % MAX_RADIO_DBG_CNT;
#endif

  return FALSE;
}
#endif

/*******************************************************************************
 * @fn          macSendReceiveCmd
 *
 * @brief       This routine is used to send MAC receive command.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      TRUE if successful, FALSE otherwise
 */
bool macSendReceiveCmd( void )
{
    SELECT_RCALL(macSendReceiveCmd);
}

/*******************************************************************************
 * @fn          macStopCmd
 *
 * @brief       This call is used to gracefully stop all foreground and
 *              background level commands that are running. This will cause
 *              the BG and FG commands to stop as soon as possible after
 *              finishing ongoing operations.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void macStopCmd(bool bGraceful )
{
    halIntState_t  s;

#ifdef DBG_TIMAC_RADIO_CB
  macRadioDbg[macRadDbg_idx].fn = MAC_ABORT_ISSUE,
  macRadioDbg[macRadDbg_idx].rf_cmd_hnd = rxCmdHandle;
  macRadioDbg[macRadDbg_idx].rf_hnd = RF_handle;
  macRadioDbg[macRadDbg_idx].ch_var = 0;
  macRadioDbg[macRadDbg_idx].rf_event = 0;
  macRadioDbg[macRadDbg_idx].sfd_detect = bGraceful;
  macRadioDbg[macRadDbg_idx].clk_ticks = Clock_getTicks();
  macRadioDbg[macRadDbg_idx].rf_cmd_status = 0;
  macRadioDbg[macRadDbg_idx].numRxCmd = numRxCmd;
  macRadioDbg[macRadDbg_idx].numRfCmd = numRfCmd;
  macRadDbg_idx = macRadDbg_idx + 1;
  macRadDbg_idx = macRadDbg_idx % MAX_RADIO_DBG_CNT;
#endif

    HAL_ENTER_CRITICAL_SECTION(s);

    /* Stop any ongoing Rx backoff */
    macRequestBackoff(BACKOFF_TYPE_RX, 0);

    //RF_getInfo(RF_handle, RF_GET_RADIO_STATE, &info);

    /* Should not flush the command queue while radio is not active.
     * There should not be any pending command to abort/stop
     * if the radio has already gone to power-down state.
     */
    //if (info.bRadioState)
    {
      /* Reconfigure the rule so the CMD_STOP won't trigger a TX nor Rx*/
      RF_cmdPropCs.condition.rule = COND_NEVER;

#ifdef DEBUG_SW_TRACE
      RF_Stat stat = RF_flushCmd(RF_handle, RF_CMDHANDLE_FLUSH_ALL, bGraceful);
      DBG_PRINT1(DBGSYS, "RF_flushCmd(stat=0x%X)", stat);
#else
      DBG_PRINT0(DBGSYS, "Abort Issued!");

      (void) RF_flushCmd(RF_handle, RF_CMDHANDLE_FLUSH_ALL, bGraceful);
#endif /* DEBUG_SW_TRACE */
      HAL_EXIT_CRITICAL_SECTION(s);
    }
}
/*******************************************************************************
 * @fn          macRxQueueFlushCmd
 *
 * @brief       On reception, the radio CPU shall flush the RX queue. Note that
 *              for radio RX overflow, the RX queue is flushed by CM0.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void macRxQueueFlushCmd( void )
{
  rfc_CMD_FLUSH_QUEUE_t rfCmd;

  /* setup an immediate command CMD_FLUSH_QUEUE */
  rfCmd.commandNo   = CMD_FLUSH_QUEUE;
  rfCmd.pQueue   = &macRxDataEntryQueue;
  rfCmd.pFirstEntry   = (uint8 *)macRxDataEntryQueue.pCurrEntry;

  /* issue command */
  (void) RF_runImmediateCmd(RF_handle, (uint32_t*) &rfCmd);

  return;
}


