nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac.c
/*******************************************************************************
 * @fn          macFreqSynthCmd
 *
 * @brief       This radio command is used to control Frequency Synthesizer.
 *
 * input parameters
 *
 * @param       channel - logic channel number.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void macFreqSynthCmd( uint8 channel )
{
  /* For test only, if Tx is needed without any underlying Rx operation
   * (i.e., no CSMA-CA), then CMD_FS (synthConf.bTxMode = 1) is necessary,
   * followed by CMD_IEEE_TX and CMD_FS_OFF. This would not be used frequently,
   * except maybe for testing, as Tx without CSMA-CA is only allowed for beacon
   * frames and ACKs.
   */
  (void) channel;
  return;
}

/*******************************************************************************
 * @fn          macSendFsCmd
 *
 * @brief       On reception, the radio CPU shall set the Frequency Synth command.
 *
 * input parameters
 *
 * @param       channel - logical channel for this frequency band.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      TRUE if successful, FALSE otherwise
 */
bool macSendFsCmd( uint8 channel )
{
  MAC_PWR_VOTE_NO_SWI(TRUE);
  macSetupFsCmd(channel);
  lastPostCmd = (uint32_t*)&RF_cmdFsRx;
  return TRUE;
}


/*******************************************************************************
 * @fn          macSetTxPowerVal
 *
 * @brief       On reception, the radio CPU shall set the TX power to
 *              txPowerVal.
 *
 * input parameters
 *
 * @param       txPowerVal - TX power value consisting of
 *                           IB, GC, boost and tempCoeff.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void macSetTxPowerVal( uint32 txPowerVal )
{
  RF_Stat status;
  RF_TxPowerTable_Value newValue;

  newValue = *(RF_TxPowerTable_Value *)&txPowerVal;
  status = RF_setTxPower(RF_handle, newValue);
  MAC_ASSERT(status == RF_StatSuccess);
  return;
}


/*******************************************************************************
 * @fn          macSetupRATChanCompare
 *
 * @brief       This call is used to setup a RAT channel compare that will
 *              generate a HW interrupt.
 *
 * @param       ratCb - RAT Callback.
 * @param       compareTim - RAT Compare Time
 *
 * @return      None.
 */
void macSetupRATChanCompare(RF_RatCallback ratCb, uint32 compareTime)
{
  int8_t chan = RF_ALLOC_ERROR;
  uint32_t powerMgr = 0;
  RF_Stat stat;
  halIntState_t s;

  HAL_ENTER_CRITICAL_SECTION(s);

  /*Disable power management, to avoid power down due to temporary ratDisable*/
  RF_control(RF_handle, RF_CTRL_SET_POWER_MGMT, &powerMgr);

  RF_RatConfigCompare compareConfig;
  RF_RatConfigCompare_init(&compareConfig);
  compareConfig.callback   = ratCb;
  compareConfig.timeout = compareTime;

  /* WA for reinitiating a RAT channel before it fires */
  if (((uint32_t) ratCb & 0xFFFFFFFE) == ((uint32_t) macRatCb_A & 0xFFFFFFFE))
  {
    if (lastRatChanA != RF_ALLOC_ERROR)
    {
      stat = RF_ratDisableChannel(RF_handle, lastRatChanA);
      MAC_ASSERT(stat == RF_StatCmdDoneSuccess);

      DBG_PRINT1(DBGSYS, "RAT: RAT ChanA(%i) disabled", lastRatChanA);
    }
    chan = RF_ratCompare(RF_handle, &compareConfig, NULL);
  }
  else if (((uint32_t) ratCb & 0xFFFFFFFE) == ((uint32_t) macRatCb_B & 0xFFFFFFFE))
  {
    if (lastRatChanB != RF_ALLOC_ERROR)
    {
      stat = RF_ratDisableChannel(RF_handle, lastRatChanB);
      MAC_ASSERT(stat == RF_StatCmdDoneSuccess);

      DBG_PRINT1(DBGSYS, "RAT: RAT ChanB(%i) disabled", lastRatChanB);
    }
    chan = RF_ratCompare(RF_handle, &compareConfig, NULL);
  }
  else
  {
    // Shouldn't be here
    MAC_ASSERT(0);
  }



  DBG_PRINT1(DBGSYS, "RAT: RF_ratCompare(RAT Channel=%i)", chan);

  if (chan < 0)
  {
    /* fatal error */
    MAC_ASSERT(0);
  }

  /* WA for reinitiating a RAT channel before it fires */
  if (((uint32_t) ratCb & 0xFFFFFFFE) == ((uint32_t) macRatCb_A & 0xFFFFFFFE))
  {
    lastRatChanA = chan;
  }
  else if (((uint32_t) ratCb & 0xFFFFFFFE) == ((uint32_t) macRatCb_B & 0xFFFFFFFE))
  {
    lastRatChanB = chan;
  }

  /*Enable power management */
  powerMgr = 1;
  RF_control(RF_handle, RF_CTRL_SET_POWER_MGMT, &powerMgr);

  HAL_EXIT_CRITICAL_SECTION(s);
}


/*******************************************************************************
 * @fn          macRatCb_A Callback
 *
 * @brief       This callback is used to carry out the processing for the RAT
 *              interrupt that corresponds to the RAT channel where the RAT
 *              command was initiated.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       h - radio handle
 * @param       ch - command handle
 * @param       e - radio event (interrupt flag)
 *
 * @return      None.
 */
void macRatCb_A(RF_Handle h, RF_RatHandle ch, RF_EventMask e, uint32_t compareCaptureTime)
{
  /* Now we are in swi context */
  bInSwi = TRUE;
  DBG_PRINT0(DBGSYS, "macRatCb_A() starts");

  /* Clear up channel A */
  lastRatChanA = RF_ALLOC_ERROR;
  DBG_PRINT0(DBGSYS, "macRatCb_A() ends");

  /* Now we are exiting the swi */
  bInSwi = FALSE;
}


/*******************************************************************************
 * @fn          macRatCb_B Callback
 *
 * @brief       This callback is used to carry out the processing for the RAT
 *              interrupt that corresponds to the RAT channel where the RAT
 *              command was initiated.
 *
 * @param       h - radio handle
 * @param       ch - command handle
 * @param       e - radio event (interrupt flag)
 *
 * @return      None.
 */
void macRatCb_B(RF_Handle h, RF_RatHandle ch, RF_EventMask e, uint32_t compareCaptureTime)
{
  /* Clear up channel B */
  lastRatChanB = RF_ALLOC_ERROR;

  if(!macTimerActive)
  {
      /*delayed swi which has already been processed*/
      return;
  }

  /* Now we are in swi context */
  bInSwi = TRUE;
  DBG_PRINT0(DBGSYS, "macRatCb_B() starts");
  DBG_PRINT0(DBGSYS, "macRatCb_B() ends");

  /* Now we are exiting the swi */
  bInSwi = FALSE;
}


