nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac.c
/*******************************************************************************
 * @fn          macRegisterSfdDetect
 *
 * @brief       Register callback for SFD detected.
 *
 * input parameters
 *
 * @param       None.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void macRegisterSfdDetect( macSfdDetectCBack_t sfdCback )
{
  macSfdDetectCback = sfdCback;
}


/*******************************************************************************
 * @fn          macSetUserConfig
 *
 * @brief       This call is used to setup user radio configurations.
 *
 * input parameters
 *
 * @param       arg - pointer to user configuration from App.
 *
 * output parameters
 *
 * @param       None.
 *
 * @return      None.
 */
void macSetUserConfig( macUserCfg_t *pUserCfg )
{
  if ( pUserCfg != NULL )
  {
    /* RF patch, Front End info, and TX Power Table */
    pMacRadioConfig = pUserCfg;

    MAC_ASSERT(pMacRadioConfig->pRfSelectFP != NULL);

    macRfDrvTblPtr = pMacRadioConfig->pRfDrvTblPtr;

#if defined(FEATURE_MAC_SECURITY)
    macCryptoDrvTblPtr = pMacRadioConfig->pCryptoDrvTblPtr;
#endif /* FEATURE_MAC_SECURITY */

#if defined(RCN_APP_ASSERT)
    if (pMacRadioConfig->pAssertFP)
    {
        assertFP.callAssrtHndler = pMacRadioConfig->pAssertFP;
        HAL_APPASRT_register(&assertFP);
    }
#endif

  }
}


/**************************************************************************************************
 * @fn          macRatDisableChannels
 *
 * @brief       Disable RAR channels to prepare for sleep.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void macRatDisableChannels(void)
{
  if (lastRatChanA != RF_ALLOC_ERROR)
  {
    RF_ratDisableChannel(RF_handle, lastRatChanA);
    DBG_PRINT1(DBGSYS, "RAT Chan A(%d) disabled", lastRatChanA);
  }
  if (lastRatChanB != RF_ALLOC_ERROR)
  {
    RF_ratDisableChannel(RF_handle, lastRatChanB);
    DBG_PRINT1(DBGSYS, "RAT Chan B(%d) disabled", lastRatChanB);
  }
  /* Mark them as not allocated */
  lastRatChanA = lastRatChanB = RF_ALLOC_ERROR;
}
/**************************************************************************************************
 * @fn          macRatDisableChannels
 *
 * @brief       Disable RAR channels to prepare for sleep.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void macRatDisableChannelB(void)
{
  if (lastRatChanB != RF_ALLOC_ERROR)
  {
    RF_ratDisableChannel(RF_handle, lastRatChanB);
    /* Mark them as not allocated */
    lastRatChanB = RF_ALLOC_ERROR;
  }

}

/**************************************************************************************************
 * @fn          macGetRFCmdDuration
 *
 * @brief       Approximate command duration based on input packet length and whether the radio
 *              must wait or transmit for an ack response/request.
 *
 * @param       uint32_t len Input packet length
 * @param       bool ackRequest Whether the input command must wait or transmit an ack.
 *
 * @return      uint32 Approximate during, in RAT ticks
 **************************************************************************************************
 */
uint32 macGetRFCmdDuration(uint32_t len, bool ackRequest)
{
    uint16 totalSymbols = 0;
    uint32_t psduByteLen = 0;
    uint8_t minBe;

    /* Obtain min backoff exponent */
    MAP_MAC_MlmeGetReq(MAC_MIN_BE, &minBe);

    /* PSDU = MHR, MAC Payload, MFR (FCS) Length in bytes is included for subg in the input length
     * and is included later for IEEE mode
     */
    psduByteLen += len;

    /* 5kbps LRM PHY */
    if (MAP_macCheckPhyRate(pMacPib->curPhyID) == PHY_MODE_SLR_5K)
    {
        /* Convert PHY + PSDU to symbols */
        totalSymbols += ((MAC_PHY_PHR_LEN + psduByteLen) * MAC_SYMBOLS_PER_OCTET_2FSK_LRM);

        /* Number of symbols in frame for Preamble, sync word and termination symbols */
        totalSymbols += MAC_PHY_SHR_LEN_2FSK_LRM + MAC_PHY_TERM_LEN_LRM;

        /* If receiver will be kept on for Rx ACK */
        if (ackRequest)
        {
            /* Add turnaround time before the ack in addition to the preamble, sync word and termination symbols */
            totalSymbols += (MAC_A_TURNAROUND_TIME + MAC_PHY_SHR_LEN_2FSK_LRM  + MAC_PHY_TERM_LEN_LRM);

            /* Add in the bytes for the OTA time for incoming ACK frame
             * MAC_LEN_ACK_FRAME = (MAC_FCF_FIELD_LEN + MAC_SEQ_NUM_FIELD_LEN + MAC_FCS4_FIELD_LEN)
             */
            totalSymbols += ((MAC_PHY_PHR_LEN + (MAC_FCF_FIELD_LEN + MAC_SEQ_NUM_FIELD_LEN + MAC_FCS4_FIELD_LEN)) * MAC_SYMBOLS_PER_OCTET_2FSK_LRM);
        }
    }
    /* Other PHY's */
    else
    {
        /* Convert Preamble, sync word (SHR), PHR, PSDU to symbols */
        totalSymbols += ((MAC_PHY_SHR_LEN_2FSK + MAC_PHY_PHR_LEN + psduByteLen) * MAC_SYMBOLS_PER_OCTET_2FSK);

        /* If receiver will be kept on for Rx ACK */
        if (ackRequest)
        {
            /* Add turnaround time before the ACK */
            totalSymbols += MAC_A_TURNAROUND_TIME;

            /* Add in the bytes in the acknowledgment frame
             * MAC_LEN_ACK_FRAME = (MAC_FCF_FIELD_LEN + MAC_SEQ_NUM_FIELD_LEN + MAC_FCS4_FIELD_LEN)
             */
            totalSymbols += ((MAC_PHY_SHR_LEN_2FSK + MAC_PHY_PHR_LEN + (MAC_FCF_FIELD_LEN + MAC_SEQ_NUM_FIELD_LEN + MAC_FCS4_FIELD_LEN)) * MAC_SYMBOLS_PER_OCTET_2FSK);
        }
    }

    /* Add interframe spacing */
    totalSymbols += (len > MAC_A_MAX_SIFS_FRAME_SIZE) ? MAC_A_MIN_LIFS_PERIOD : MAC_A_MIN_SIFS_PERIOD;

    /* Convert symbols to microseconds, then RAT Ticks */
    return (RF_convertUsToRatTicks(totalSymbols * macSpecUsecsPerSymbol));
}
/*******************************************************************************
 */
/**************************************************************************************************
 * @fn          macRequestBackoff
 *
 * @brief       This function is used to start a backoff for either a Tx or Rx or NOP command.
 *
 * @param       backoffType: BACKOFF_TYPE_TX, BACKOFF_TYPE_RX, BACKOFF_TYPE_NOP
 * @param       backOffDur: Backoff duration in us
 *
 * @return      none
 **************************************************************************************************
 */
void macRequestBackoff(uint8_t backoffType, uint32_t backOffDur)
{
   uint32_t key;
   uint32_t backoffPeriod;

   key = OsalPort_enterCS();

