nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac.c
   backoffPeriod = (uint32_t)backOffDur/MAP_ICall_getTickPeriod();

   if (backoffType == BACKOFF_TYPE_TX)
   {
       DBG_PRINT0(DBGSYS, "macRequestBackoff(Tx)");

       /* Stop existing timer if backoff period is 0 */
       if (!backoffPeriod)
       {
           OsalPort_stopTimer((MAP_ICall_TimerID*)macTxBackoffRtcTimerId);
       }
       else
       {
           MAP_ICall_setTimer(backoffPeriod, (MAP_ICall_TimerCback)macTxBackoffTimerExpiry,
               NULL, &macTxBackoffRtcTimerId);
       }
   }
   else if (backoffType == BACKOFF_TYPE_RX)
   {
       DBG_PRINT0(DBGSYS, "macRequestBackoff(Rx)");

       /* Stop existing timer if backoff period is 0 */
       if (!backoffPeriod)
       {
           OsalPort_stopTimer((MAP_ICall_TimerID*)macRxBackoffRtcTimerId);
       }
       else
       {
           MAP_ICall_setTimer(backoffPeriod, (MAP_ICall_TimerCback)macRxBackoffTimerExpiry,
               NULL, &macRxBackoffRtcTimerId);
       }
   }
  OsalPort_leaveCS(key);
}
/**************************************************************************************************
 * @fn          macTxBackoffTimerExpiry
 *
 * @brief       Throw an event for the Tx backoff timer expiry
 *
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macTxBackoffTimerExpiry(void *arg)
{
    MAP_macSetEvent16(MAC_TX_BACKOFF_TIM_TASK_EVT);
}

/**************************************************************************************************
 * @fn          macRxBackoffTimerExpiry
 *
 * @brief       Throw an event for the Rx backoff timer expiry
 *
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRxBackoffTimerExpiry(void *arg)
{
    MAP_macSetEvent16(MAC_RX_BACKOFF_TIM_TASK_EVT);
}

/**************************************************************************************************
 * @fn          macNopBackoffTimerExpiry
 *
 * @brief       Throw an event for the Nop backoff timer expiry
 *
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macNopBackoffTimerExpiry(void *arg)
{
    /* Attempt to reschedule NOP command */
    DBG_PRINT0(DBGSYS, "MAC Execute Backoff(NOP)");

    /* Execute Dummy NOP Cb and treat as preempted after backoff time */
     numRfCmd++;
     macRadioWakeupCb(NULL, NULL, RF_EventCmdPreempted);
}
